{
  "backend/main.mo": "Main Motoko actor implementing user profiles, friends management, and messaging with access control via a mixin authorization pattern. Stores data in Maps keyed by Principal and enforces permission checks on all mutations.",
  "feature_evidence.json": "Feature evidence report linking the Internet Identity login flow fix (AuthClient callback, identity state update, AuthGuard redirect) to specific frontend files and test requirement REQ-6.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, serving as a reference index for the project's React/Tailwind frontend components and pages.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH-based CSS custom properties for light and dark themes, covering background, foreground, card, sidebar, chart, and destructive color tokens.",
  "frontend/index.html": "Minimal HTML entry point titled 'Friends Connect' that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Main React app entry that sets up TanStack Router with routes for friends list, friends management, call, and chat pages, wrapped in an AuthGuard that handles initializing/logging-in states and profile setup.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Unauthenticated landing screen with an Internet Identity login button that auto-retries after clearing stale auth state when a 'User is already authenticated' error is detected.",
  "frontend/src/components/CallControls.tsx": "Reusable call control bar component with mute, video toggle, and end-call buttons, each wrapped in tooltips and styled with teal/coral accent colors.",
  "frontend/src/components/Layout.tsx": "Main app layout component with a sticky header containing logo, desktop navigation links, and a user dropdown menu with logout functionality.",
  "frontend/src/components/MessageBubble.tsx": "Renders a single chat message bubble styled differently for sent vs. received messages, with a hover-revealed timestamp.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter a display name and saves their profile via mutation on first login.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context including login, logout, and identity state via an AuthClient-backed React context and hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions: user profile CRUD, friends list management, and message fetching/sending.",
  "frontend/src/index.css": "Global stylesheet defining Tailwind base/utilities, CSS custom properties for light/dark themes (teal and coral palettes), and typography using Inter and Space Grotesk fonts.",
  "frontend/src/main.tsx": "App entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CallPage.tsx": "Renders an active call UI for a given username with a live timer, mute/video toggle controls, pulse animations, and navigates back home when the call ends.",
  "frontend/src/pages/ChatPage.tsx": "Displays a real-time chat interface with a specific friend, supporting message fetching, sending via Enter key, auto-scroll, and a button to initiate a call.",
  "frontend/src/pages/FriendsListPage.tsx": "Shows a grid of the current user's friends with chat and call action buttons, plus loading/empty/error states and a shortcut to add more friends.",
  "frontend/src/pages/FriendsManagementPage.tsx": "Provides a form to add friends by username and a searchable list of existing friends with confirmation-gated removal, using toast notifications for feedback.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading URL query parameters from both standard and hash-based routes, persisting them in sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom color palette using oklch CSS variables (teal, coral, surface, sidebar, chart), custom fonts (Inter, Space Grotesk), border radii, box shadows, and keyframe animations for accordion and pulse effects.",
  "project_state.json": "Project state manifest describing a social app with friends list, chat, simulated calling, and Internet Identity login features, noting a known login bug and listing existing and new feature requests with versioning metadata."
}