{
  "backend/main.mo": "Main Motoko actor implementing user profile storage, friends management (add/remove/list), and per-friend conversation messaging with access control via a mixin authorization pattern.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (friends list, friends management, call screen, chat screen, visual theme) to their corresponding source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries for each frontend source file, describing their purpose and any notable implementation details.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, card, chart, and sidebar tokens.",
  "frontend/index.html": "Minimal HTML entry point titled 'Friends Connect' that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for friends list, friends management, call, and chat pages, wrapped in an AuthGuard that handles authentication state and profile setup.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Full-page unauthenticated landing screen displaying app branding, feature highlights (chat, call, friends), and an Internet Identity login button.",
  "frontend/src/components/CallControls.tsx": "Reusable call control bar component with mute, video toggle, and end-call buttons styled with teal/coral accents and tooltip labels.",
  "frontend/src/components/Layout.tsx": "Main app layout component with a sticky header, logo, desktop/mobile navigation links, and a user dropdown menu with logout functionality.",
  "frontend/src/components/MessageBubble.tsx": "Renders a single chat message bubble styled differently for sent vs. received messages, with a hover-revealed timestamp.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts a new user to enter a display name and saves it via the saveCallerUserProfile mutation.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context with login, logout, and identity state management via DFINITY's AuthClient, exposed through a React context and hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profile, friends list, and messages (fetch and mutate operations).",
  "frontend/src/index.css": "Global CSS file defining Tailwind base/utilities, CSS custom properties for light/dark theme color tokens (teal, coral, surfaces), and typography setup.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/CallPage.tsx": "Renders an active call UI for a given username with a live timer, mute/video toggle controls, pulse animations, and navigates back home when the call ends.",
  "frontend/src/pages/ChatPage.tsx": "Displays a real-time chat interface with a specific friend, supporting message fetching, sending via Enter key, auto-scroll, and a button to initiate a call.",
  "frontend/src/pages/FriendsListPage.tsx": "Shows a grid of the current user's friends with chat and call action buttons, plus loading/empty/error states and a shortcut to add more friends.",
  "frontend/src/pages/FriendsManagementPage.tsx": "Provides a form to add friends by username and a searchable list of existing friends with confirmation-gated removal, using toast notifications for feedback.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading URL query parameters from both standard and hash-based routes, persisting them to sessionStorage, and cleaning sensitive params from the URL hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the Friends Connect frontend, defining dark mode, custom color tokens (teal, coral, surface, sidebar, chart) using oklch CSS variables, custom fonts (Inter, Space Grotesk), border radii, box shadows, and keyframe animations. Includes plugins for typography, container queries, and animate.",
  "project_state.json": "Project state descriptor for 'Friends Connect', a social app with friends list, chat, simulated calling, and friends management features. Tracks existing implemented features, pending new feature requests, architectural notes, and image requirements at schema version 1.0.0."
}