{
  "kind": "build_request",
  "title": "Fix login / Internet Identity authentication flow",
  "projectName": "Friends Connect",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-6",
      "text": "Diagnose and fix the Internet Identity login flow so that users can successfully authenticate via the login button on the AccessDeniedScreen. The AuthClient must complete the login callback, update the identity state in the InternetIdentityProvider context, and redirect authenticated users into the app (triggering the AuthGuard to show the main content instead of the landing screen).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "I can't login"
        ]
      },
      "acceptanceCriteria": [
        "Clicking the Internet Identity login button on the landing screen opens the Internet Identity authentication flow without errors.",
        "After completing authentication, the user is redirected to the Friends List page (the default authenticated route).",
        "The AuthGuard correctly detects the authenticated identity and does not keep showing the AccessDeniedScreen after login.",
        "If the user is new, the ProfileSetupModal is shown to collect a display name after login completes.",
        "Logging out from the user dropdown returns the user to the AccessDeniedScreen.",
        "No console errors related to AuthClient, identity, or actor initialization appear during the login flow."
      ]
    }
  ],
  "constraints": [
    "Do not modify frontend/src/hooks/useInternetIdentity.ts or frontend/src/hooks/useActor.ts directly — propose fixes through wrapper logic or configuration changes only.",
    "Do not alter the existing backend authentication/authorization logic."
  ],
  "nonGoals": [
    "Adding new authentication providers beyond Internet Identity.",
    "Changing the visual design of the login screen.",
    "Modifying any backend data models or APIs."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}