{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Internet Identity Authentication Flow",
  "requirements": [
    {
      "id": "REQ-6",
      "summary": "Fix the Internet Identity login flow to enable successful authentication, proper identity state management, and correct routing from AccessDeniedScreen to the authenticated app",
      "acceptanceCriteria": [
        "Clicking the Internet Identity login button on the landing screen opens the Internet Identity authentication flow without errors.",
        "After completing authentication, the user is redirected to the Friends List page (the default authenticated route).",
        "The AuthGuard correctly detects the authenticated identity and does not keep showing the AccessDeniedScreen after login.",
        "If the user is new, the ProfileSetupModal is shown to collect a display name after login completes.",
        "Logging out from the user dropdown returns the user to the AccessDeniedScreen.",
        "No console errors related to AuthClient, identity, or actor initialization appear during the login flow."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AccessDeniedScreen.tsx",
          "operation": "modify",
          "description": "Update the login button handler to use the authorization component's login pattern with proper error handling. Ensure the button correctly calls the login function from useInternetIdentity and handles the 'User is already authenticated' error by clearing state and retrying. Add disabled state during the login process and display appropriate loading text. Verify the authorization component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Review and fix the AuthGuard logic to properly detect authenticated identity state from the InternetIdentityProvider context. Ensure the guard correctly shows AccessDeniedScreen for unauthenticated users and allows authenticated users through to the main router. Fix any timing issues where the identity state might not be properly initialized before the guard renders. Add proper loading states to prevent flashing between authenticated and unauthenticated views."
        },
        {
          "path": "frontend/src/components/ProfileSetupModal.tsx",
          "operation": "modify",
          "description": "Ensure the ProfileSetupModal follows the authorization component's pattern for preventing modal flash. Use the custom useGetCallerUserProfile hook pattern that properly handles actor dependency state (isLoading should reflect both actorFetching and query.isLoading). The modal should only appear when isAuthenticated && !profileLoading && isFetched && userProfile === null. Verify that profile data is properly invalidated and refetched after the Internet Identity login callback completes."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Implement or update the useGetCallerUserProfile hook to match the authorization component's recommended pattern. Return custom state that includes actorFetching in isLoading and ensures isFetched only returns true when actor is available. Add queryKey ['currentUserProfile'] for proper cache management. Ensure the hook is enabled only when actor exists and is not fetching. This prevents premature profile setup modal display during the authentication flow."
        },
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Update the logout handler in the user dropdown to properly clear the identity state and all cached application data including the user profile, following the authorization component's logout pattern. Ensure the logout calls clear() from useInternetIdentity and queryClient.clear() to reset all React Query caches. Verify that after logout, the user is returned to the AccessDeniedScreen with no residual authenticated state."
        },
        {
          "path": "frontend/src/utils/urlParams.ts",
          "operation": "modify",
          "description": "Review URL parameter handling for the Internet Identity callback flow. Ensure that authentication callback parameters are properly extracted from both standard query strings and hash-based routes, persisted to sessionStorage if needed for the login flow, and cleaned from the URL after processing. Fix any issues where callback parameters might not be accessible to the AuthClient, preventing successful login completion."
        }
      ]
    }
  ]
}